package com.gl365.payment.enums.msg;
public enum Msg {
	/**
	 * 交易成功
	 */
	S000("0000", "交易成功"),
	/**
	 * 交易失败
	 */
	F000("9999", "交易失败"),
	/**
	 * 用户状态不正常
	 */
	PAY_8001("8001", "用户状态不正常"),
	/**
	 * 商户状态不正常
	 */
	PAY_8002("8002", "商户状态不正常"),
	/**
	 * 未绑卡
	 */
	PAY_8003("8003", "未绑卡"),
	/**
	 * 原单状态不正常
	 */
	PAY_8004("8004", "原单状态不正常"),
	/**
	 * 原单交易时间与冲正日期不在同天
	 */
	PAY_8005("8005", "原单交易日期与现交易日期不在同天"),
	/**
	 * 帐户余额不能冲返利乐豆或乐豆账户充减记流水失败
	 */
	PAY_8006("8006", "帐户余额不能冲返利乐豆或乐豆账户充减记流水失败 "),
	/**
	 * 通过卡索引号查找用户不存在
	 */
	PAY_8007("8007", "通过卡索引号查找用户不存在 "),
	/**
	 * 参数非法
	 */
	PAY_8008("8008", "参数非法 "),
	/**
	 * 卡索引不一致
	 */
	PAY_8009("8009", "卡索引不一致 "),
	/**
	 * 商户号不一致
	 */
	PAY_8010("8010", "商户号不一致 "),
	/**
	 * 退款的余额不足
	 */
	PAY_8011("8011", "退款的余额不足 "),
	/**
	 * 原单不存在
	 */
	PAY_8012("8012", "原单不存在 "),
	/**
	 * 超过2分钟
	 */
	PAY_8013("8013", "原单操作已超过2分钟"),
	/***/
	PAY_8014("8014", "交易金额不一致"),
	/**
	 * 原单请求日期为空
	 */
	PAY_8015("8015", "原单请求日期为空 "),
	/**
	 * 冲返利乐豆流水返回结果为空
	 */
	PAY_8016("8016", "冲返利乐豆流水返回结果为空 "),
	/**
	 * 冲返利乐豆流水返回结果为空
	 */
	PAY_8017("8017", "冲返利乐豆流水返回结果集为空 "),
	/**
	 * 原消费确认交易流水号不正确
	 */
	PAY_8018("8018", "原交易流水号不正确 "),
	/**
	 * 终端号不一致
	 */
	PAY_8019("8019", "终端号不一致"),
	/**
	 * 原单交易类型不一致
	 */
	PAY_8020("8020", "原单交易类型不一致"),
	/**
	 * 商户线上支付禁用
	 */
	PAY_8021("8021", "商户线上支付禁用 "),
	/**
	 * 原消费撤销交易流水
	 */
	PAY_8022("8022", "原消费撤销交易流水不存在 "),
	/**
	 * 该订单类型不能退货
	 */
	PAY_8023("8023", "该订单类型不能退货"),
	/**
	 * 账户乐豆余额不足
	 */
	PAY_8024("8024", "账户乐豆余额不足"),
	/**
	 * 原单状态不正确
	 */
	PAY_8025("8025", "原单状态不正确"),
	/**
	 * 融脉订单号不正确
	 */
	PAY_8026("8026", "融脉订单号不正确"),
	/**
	 *支付确认支付时间为空
	 */
	PAY_P8027("P8027", "支付确认支付时间为空"),
	/**
	 * 退款单号为空
	 */
	PAY_P8028("P8028", "退款单号为空"),
	/**
	 * 机构代码非空最大长度15位
	 */
	REQ_0015("8015", "机构代码非空且最大长度15位"),
	/**
	 * 请求交易流水号非空最大长度32位
	 */
	REQ_0016("0016", "请求交易流水号非空最大长度32位,且只能为字母和数字"),
	/**
	 * 请求交易日期非空
	 */
	REQ_0017("0017", "请求交易日期非空"),
	/**
	 * 商户号非空最大长度15位
	 */
	REQ_0018("0018", "机构商户号非空且最大长度15位"),
	/**
	 * 终端号最大长度为20位
	 */
	REQ_0019("0019", "终端号最大长度为20位"),
	/**
	 * 终端号最大长度8位
	 */
	REQ_0020("0020", "绑卡索引号非空且最大长度32位"),
	/**
	 * 消费金额非空且大于0
	 */
	REQ_0021("0021", "消费金额非空且大于0"),
	/**
	 * 原消费确认交易流水号非空最大长度32位
	 */
	REQ_0022("0022", "原交易流水号非空最大长度32位"),
	/**
	 * 原交易日期非空
	 */
	REQ_0023("0023", "原交易日期非空"),
	/**
	 * 原预授权完成确认交易流水号非空
	 */
	REQ_0024("0024", "原交易流水号非空"),
	/**
	 * 原预授权完成确认交易日期非空
	 */
	REQ_0025("0025", "原交易日期非空"),
	/**
	 * 终端号不一致
	 */
	REQ_0026("0026", "终端号不一致"),
	/**
	 * 终端号长度不能超过2位
	 */
	REQ_0027("0027", "支付场景长度不能超过2位"),
	/**
	 * 订单标题长度不能超过128位
	 */
	REQ_0029("0029", "订单标题长度不能超过128位"),
	/**
	 * 订单描述长度不能超过512位
	 */
	REQ_0030("0030", "订单描述长度不能超过512位"),
	/**
	 * 商户操作员编号长度不能超过64位
	 */
	REQ_0031("0031", "商户操作员编号长度不能超过64位"),
	/**
	 * 不可返利金额非空
	 */
	REQ_0032("0032", "不可返利金额非空"),
	/**
	 * 成本价非空且大于0
	 */
	REQ_0033("0033", "成本价非空且大于0"),
	/**
	 * 商品成本价小于交易总金额
	 */
	REQ_0034("0034", "商品成本价不能大于或等于交易总金额"),
	/**
	 * 订单类型错误
	 */
	REQ_0035("0035", "订单类型错误"),
	/**
	 * 给乐商户号非空最大长度15位
	 */
	REQ_0036("0036", "给乐商户号非空且最大长度15位"),
	/**
	 * 给乐用户号非空最大长度32位
	 */
	REQ_0037("0037", "给乐用户号非空最大长度32位"),
	/**
	 * 商户订单号非空最大长度32位
	 */
	REQ_0038("0038", "商户订单号非空最大长度32位"),
	/**
	 * 订单类型
	 */
	REQ_0039("0039", "订单类型非空最大长度1位"),
	/**
	 * 融脉订单号非空最大长度32位
	 */
	REQ_0040("0040", "融脉订单号非空最大长度32位"),
	/**
	 * 通道订单号非空最大长度32位
	 */
	REQ_0041("0041", "通道订单号非空最大长度32位"),
	/**
	 * 现金消费金额非空且大于0
	 */
	REQ_0042("0042", "现金消费金额非空且大于0"),
	/**
	 * 支付结果非空最大长度1位
	 */
	REQ_0043("0043", "支付结果非空最大长度1位"),
	/**
	 * 交易时间
	 */
	REQ_0044("0044", "交易时间非空"),
	/**
	 * 支付乐豆不能为空
	 */
	REQ_0045("0045", "支付乐豆不能为空"),
	/**
	 * 被打赏原支付单号非空且最大长度32位
	 */
	REQ_0046("0046", "被打赏原支付单号非空且最大长度32位"),
	/**
	 * 群组id非空且最大长度32位
	 */
	REQ_0047("0047", "群组id非空且最大长度32位"),
	/**
	 * 分单标志错误
	 */
	REQ_0048("0048", "分单标志错误"),
	/**
	 * 群支付给乐商家号非空且最大长度32位
	 */
	REQ_0049("0049", "群支付给乐商家号非空且最大长度32位"),
	/**
	 * 发起人应支付总额非空
	 */
	REQ_0050("0050", "发起人应支付总额非空"),
	/**
	 * 发起人应支付金额错误
	 */
	REQ_0051("0051", "发起人应支付金额错误"),
	/**
	 * 打赏用户与被打赏用户一致
	 */
	REQ_0052("0052", "打赏用户与被打赏用户一致"),
	/**
	 * 调用商户系统返回结果为空
	 */
	REMOTE_MER_2000("2000", "调用商户系统返回结果为空"),
	/**
	 * 返佣方式非空
	 */
	REMOTE_MER_GlFeeType("2001", "返佣方式非空"),
	/**
	 * 返佣方式非空
	 */
	REMOTE_MER_GlFeeRate("2002", "返佣方式非空"),
	/**
	 * 返利率非空
	 */
	REMOTE_MER_SaleRate("2003", "返利率非空且值不能大于99"),
	/**
	 * 商家所在区域非空
	 */
	REMOTE_MER_District("2004", "商家所在区域非空"),
	/**
	 * 商家所在省非空
	 */
	REMOTE_MER_Province("2005", "商家所在省非空"),
	/**
	 * 商家所在市非空
	 */
	REMOTE_MER_City("2006", "商家所在市非空"),
	/**
	 * 给乐商户号非空
	 */
	REMOTE_MER_MerchantNo("2007", "给乐商户号非空"),
	/**
	 * 商家简称非空
	 */
	REMOTE_MER_MerchantShortname("2008", "商家简称非空"),
	/**
	 * 发展机构非空
	 */
	REMOTE_MER_AgentNo("2009", "发展机构非空"),
	/**
	 * 清算支付公司非空
	 */
	REMOTE_MER_SettleOrganNo("2010", "清算支付公司非空"),
	/**
	 * 发展商户机构上级机构非空
	 */
	REMOTE_MER_ParentAgentNo("2011", "发展商户机构上级机构非空"),
	/**
	 * 发展商户机构上级机构非空
	 */
	REMOTE_MER_InviteAgentNo("2022", "推广业务员非空"),
	/**
	 * POS借记卡手续费费率非空
	 */
	REMOTE_MER_PosDebitFeeRate("2023", "POS借记卡手续费费率非空且大于0"),
	/**
	 * POS借记卡手续费封顶值非空
	 */
	REMOTE_MER_PosDebitMaxAmt("2024", "POS借记卡手续费封顶值非空"),
	/**
	 * POS贷记卡手续费费率非空
	 */
	REMOTE_MER_PosCreditFeeRate("2025", "POS贷记卡手续费费率非空且大于0"),
	/**
	 * POS贷记卡手续费封顶值非空
	 */
	REMOTE_MER_PosCreditMaxAmt("2026", "POS贷记卡手续费封顶值非空"),
	/**
	 * 在线支付借记卡手续费率非空
	 */
	REMOTE_MER_OnpayDebitFeeRate("2027", "在线支付借记卡手续费率非空且大于0"),
	/**
	 * 在线支付借记卡手续费封顶值非空
	 */
	REMOTE_MER_OnpayDebitMaxAmt("2028", "在线支付借记卡手续费封顶值非空"),
	/**
	 * 在线支付贷记卡手续费率非空
	 */
	REMOTE_MER_OnpayCreditFeeRate("2029", "在线支付贷记卡手续费率非空且大于0"),
	/**
	 * 在线支付贷记卡手续费封顶值非空
	 */
	REMOTE_MER_OnpayCreditMaxAmt("2030", "在线支付贷记卡手续费封顶值非空"),
	/**
	 * 商户乐豆支付开关非空
	 */
	REMOTE_MER_LdSale("2031", "商户乐豆支付开关非空"),
	/**
	 * 商家所在区域代理商非空
	 */
	REMOTE_MER_DistAgent("2032", "商家所在区域代理商非空"),
	/**
	 * 商户乐豆支付关闭,终止交易
	 */
	REMOTE_MER_LdSale_OFF("2033", "商户乐豆支付关闭,终止交易"),
	/**
	 * 商户交易通道[线上或线下支付]非空
	 */
	REMOTE_MER_ONlINE_PAY("2034", "商户交易通道[线上或线下支付]非空"),
	/**
	 * 上级商户号非空且长度不能超过15位
	 */
	PARENT_MERCHANT_NO("P2034", "上级商户号非空且长度不能超过15位"),
	/**
	 * 结算商户号非空且长度不能超过15位
	 */
	SETTLE_MERCHANT_NO("P2035", "结算商户号非空且长度不能超过15位"),
	/**
	 * 调用会员系统返回结果为空
	 */
	REMOTE_MEM_3000("3000", "调用会员系统返回结果为空"),
	/**
	 * 调用会员系统返回结果-发展会员商家店长为空
	 */
	REMOTE_MEM_3001("3001", "调用会员系统返回结果-发展会员商家店长为空"),
	/**
	 * 调用会员系统返回结果-发展会员商家店长为空
	 */
	REMOTE_MEM_3002("3002", "调用会员系统返回结果-发展会员商家员工为空"),
	/**
	 * 调用会员系统返回结果-会员名称为空
	 */
	REMOTE_MEM_3003("3003", "调用会员系统返回结果-会员名称为空"),
	/**
	 * 调用会员系统返回结果-发展会员机构ID
	 */
	REMOTE_MEM_3004("3004", "调用会员系统返回结果-发展会员机构ID"),
	/**
	 * 调用会员系统返回结果-发展会员机构类型值非法
	 */
	REMOTE_MEM_3005("3005", "调用会员系统返回结果-发展会员机构类型值非法"),
	/**
	 * 调用会员系统返回结果-订单类型为空
	 */
	REMOTE_MEM_3006("3006", "调用会员系统返回结果-订单类型为空"),
	/**
	 * 调用会员系统返回结果-会员手机号为空
	 */
	REMOTE_MEM_3007("3007", "调用会员系统返回结果-会员手机号为空"),
	/**
	 * 调用会员系统返回结果-支付乐豆开关为空
	 */
	REMOTE_MEM_3008("3008", "调用会员系统返回结果-支付乐豆开关为空"),
	/**
	 * 调用会员系统返回结果-用户ID为空
	 */
	REMOTE_MEM_3009("3009", "调用会员系统返回结果-用户ID为空"),
	/**
	 * 调用账户系统返回结果为空
	 */
	REMOTE_ACC_4000("4000", "调用账户系统返回结果为空"),
	/**
	 * 用户ID为空
	 */
	REMOTE_ACC_4001("4001", "用户ID为空"),
	/**
	 * 用户绑卡标志为空
	 */
	REMOTE_ACC_4002("4002", "用户绑卡标志为空"),
	/**
	 * 卡号为空
	 */
	REMOTE_ACC_4003("4003", "卡号为空"),
	/**
	 * 卡类型为空
	 */
	REMOTE_ACC_4004("4004", "卡类型为空"),
	/**
	 * 绑卡状态为空
	 */
	REMOTE_ACC_4005("4005", "绑卡状态为空"),
	/**
	 * 绑卡状态不正常
	 */
	REMOTE_ACC_4006("4006", "绑卡状态不正常"),
	/**
	 * 卡类型值非法
	 */
	REMOTE_ACC_4007("4007", "卡类型值非法"),
	/**
	 * 调用网关查询订单结果返回为空
	 */
	REMOTE_GETWAY_5001("5001", "调用网关查询订单结果返回为空"),
	/**
	 * 调用结算返回结果为空
	 */
	REMOTE_SETTLE_6000("6000", "调用结算系统返回结果为空"),
	/**
	 * 获取确认待清算日期为空
	 */
	REMOTE_SETTLE_P6001("P6001", "确认待清算日期为空"),
	/**
	 * 获取确认待清算日期返回结果为空
	 */
	REMOTE_SETTLE_P6002("P6002", "获取确认待清算日期返回结果为空"),
	// 输入参数校验
	IVD_NULL_organCode_1001("1001", "机构代码不能为空"),
	/**
	 * 
	 */
	IVD_NULL_requestId_1002("1002", "请求交易流水号不能为空"),
	/**
	 * 
	 */
	IVD_NULL_requestDate_1003("1003", "请求交易日期不能为空"),
	/**
	 * 
	 */
	IVD_NULL_organMerchantNo_1004("1004", "商户号不能为空"),
	/**
	 * 
	 */
	IVD_NULL_terminal_1005("1005", "终端号不能为空"),
	/**
	 * 
	 */
	IVD_NULL_operator_1006("1006", "操作员不能为空"),
	/**
	 * 
	 */
	IVD_NULL_cardIndex_1007("1007", "绑卡索引号不能为空"),
	/**
	 * 
	 */
	IVD_NULL_totalAmount_1008("1008", "消费金额/退货金额不能为空"),
	/**
	 * 
	 */
	IVD_NULL_origPayId_1009("1009", "原网上消费交易流水号/消费查询交易流水号不能为空"),
	/**
	 * 
	 */
	IVD_NULL_origTxnDate_1010("1010", "原交易日期不能为空"),
	/**
	 * 
	 */
	IVD_NULL_giftPoint_1011("1011", "赠送积分不能为空"),
	/**
	 * 
	 */
	IVD_NULL_marketFee_1012("1012", "营销费不能为空"),
	/**
	 * 
	 */
	IVD_NULL_coinAmount_1013("1013", "乐币不能为空"),
	/**
	 * 
	 */
	IVD_NULL_beanAmount_1014("1014", "乐豆不能为空"),
	/**
	 * 
	 */
	IVD_NULL_cashMoney_1015("1015", "实扣金额不能为空"),
	/**
	 * 
	 */
	IVD_NULL_giftAmount_1016("1016", "赠送金额不能为空"),
	/**
	 * 
	 */
	IVD_NULL_merchantOrderTitle_1017("1017", "订单标题不能为空"),
	/**
	 * 
	 */
	IVD_NULL_merchantOrderDesc_1018("1018", "订单描述不能为空"),
	/**
	 * 
	 */
	IVD_NULL_tranType_1099("1099", "交易类型不能为空"),
	/**
	 * 
	 */
	IVD_NULL_merchantOrderNo_1019("1019", "给乐订单号不能为空"),
	/**
	 * 
	 */
	IVD_NULL_noBenefitAmount_1020("1020", "不可返利金额不能为空"),
	/**
	 * 
	 */
	IVD_NULL_payChannel_1021("1021", "交易通道不能为空"),
	/**
	 * 
	 */
	IVD_NULL_rewardPayId_1022("1022", "被打赏交易单号不能为空"),
	/**
	 * 
	 */
	IVD_NULL_rewardUserId_1023("1023", "被打赏人不能为空"),
	/**
	 * 
	 */
	IVD_NULL_payUserId_1024("1024", "支付用户ID不能为空"),
	/**
	 * 
	 */
	IVD_NULL_payldmoney_1025("1025", "支付乐豆不能为空"),
	/**
	 * 
	 */
	IVD_NULL_groupMainUserPay_1026("1026", "发起人应支付总额"),
	/**
	 * 
	 */
	IVD_NULL_groupOrderId_1027("1027", "群组id不能为空"),
	/**
	 * 
	 */
	IVD_NULL_splitFlag_1028("1028", "分单标志不能为空"),
	/**
	 * 
	 */
	IVD_NULL_groupMerchantNo_1029("1029", "群支付给乐商家号不能为空"),
	/**
	 * 
	 */
	IVD_LEN_organCode_1001("1101", "机构代码长度不能超过15位"),
	/**
	 * 
	 */
	IVD_LEN_requestId_1002("1102", "请求交易流水号不能超过32位"),
	/**
	 * 
	 */
	IVD_LEN_requestDate_1003("1103", "请求交易日期必须是8位"),
	/**
	 * 
	 */
	IVD_LEN_organMerchantNo_1104("1004", "商户号不能超过15位"),
	/**
	 * 
	 */
	IVD_LEN_terminal_1005("1105", "终端号必须是8位"),
	/**
	 * 
	 */
	IVD_LEN_operator_1006("1106", "操作员不能超过32位"),
	/**
	 * 
	 */
	IVD_LEN_cardIndex_1007("1107", "绑卡索引号不能超过32位"),
	/**
	 * 
	 */
	// IVD_LEN_totalAmount_1008("1108","消费金额/退货金额不能超过15位"),
	/**
	 * 
	 */
	IVD_LEN_origPayId_1009("1109", "原网上消费交易流水号/消费查询交易流水号不能超过32位"),
	/**
	 * 
	 */
	IVD_LEN_origTxnDate_1010("1110", "原交易日期必须是8位"),
	// IVD_LEN_giftPoint_1011("1111","赠送积分长度过长"),
	// IVD_LEN_marketFee_1012("1112","营销费长度过长"),
	// IVD_LEN_coinAmount_1013("1113","乐币长度过长"),
	// IVD_LEN_beanAmount_1014("1114","乐豆长度过长"),
	// IVD_LEN_cashMoney_1015("1115","实扣金额长度过长"),
	// IVD_LEN_giftAmount_1016("1116","赠送金额长度过长"),
	IVD_LEN_merchantOrderTitle_1017("1017", "订单标题不能超过128位"),
	/**
	 * 
	 */
	IVD_LEN_merchantOrderDesc_1018("1018", "订单描述不能超过512位"),
	/**
	 * 
	 */
	IVD_LEN_merchantOrderNo_1019("1019", "给乐订单号不能超过32位"),
	/**
	 * 
	 */
	IVD_LEN_organOrderNo_1022("1022", "支付公司订单号不能超过32位"),
	/**
	 * 
	 */
	IVD_LEN_payChannel_1021("1021", "交易通道不能只能是1位，并且值只能是1或2"),
	/**
	 * 
	 */
	IVD_FORMAT_merchantOrderDesc_1023("1023", "订单描述格式错误"),
	/**
	 * 成本价+返利金额不能大于或等于交易总金额
	 */
	IVD_ILLEGAL_costPriceOrGiftRate_1024("1024", "成本价+返利金额不能大于或等于交易总金额"),
	/**
	 * 
	 */
	IVD_LEN_payUserId_1025("1025", "支付用户ID不能超过32位"),
	/**
	 * 
	 */
	IVD_LEN_rewardPayId_1026("1026", "被打赏原支付单号不能超过32位"),
	/**
	 * 
	 */
	IVD_LEN_rewardUserId_1027("1027", "接收用户ID不能超过32位"),
	/**
	 * 
	 */
	IVD_LEN_groupOrderId_1028("1028", "群组单号不能超过32位"),
	/**
	 * 
	 */
	IVD_LEN_groupMerchantNo_1029("1028", "群组消费商家号不能超过32位"),
	/**
	 * 
	 */
	PARSE_FORMAT_FAIL("9997", "解析/格式化错误"),
	/**
	 * 
	 */
	MICRO_SERVICE_FAIL("9998", "微服务调用失败"),
	/**
	 * 
	 */
	UNKNOW_FAIL("9999", "未知异常"),
	/**
	 * 
	 */
	ACCOUNT_SERVICE_ERROR("account", "调用account服务失败"),
	/**
	 * 
	 */
	MEMGER_SERVICE_ERROR("member", "调用member服务失败"),
	/**
	 * 
	 */
	GETWAY_SERVICE_ERROR("getway", "调用getway服务失败"),
	/**
	 * 
	 */
	MERCHANT_ERROR("merchant", "调用merchant服务失败");
	private final String code;
	private final String desc;

	private Msg(String code, String desc) {
		this.code = code;
		this.desc = desc;
	}

	public String getDesc() {
		return desc;
	}

	public String getCode() {
		return code;
	}
}
